app/Helpers/log_helper.php

    function log_to_db(array $data)
    {
        $logModel = new \App\Models\BpjsLogModel();
        $logModel->insert($data);
---
INSERT INTO "bpjs_logs" ("endpoint", "method", "request_header", "request_body", "response_code", "response_body", "created_at") VALUES ('https://apijkn-dev.bpjs-kesehatan.go.id/apotek-rest-dev/referensi/obat/1/2024-09-01/asam', 'GET',  E'{"X-cons-id":"14321","X-timestamp":"1762714613","X-signature":"Mmr5ZlMKEU4yi0A3LevmDmCEnnwaQEHL3wGThYWbkfg=","user_key":"5d50b7d8b05f3207171d1bad86e8ea73","Accept":"application\\/json"}', 'null', 200, '{"response":{"list":[{"kode":"14240304374","nama":"Asam asetilsalisilat (asetosal) 100 SK tab 100 mg","harga":"222"},{"kode":"14240304940","nama":"Asam asetilsalisilat (asetosal) 80 SK tab 80 mg","harga":"215"}]},"metaData":{"code":"200","message":"OK"}}', '2025-11-10 01:56:54')