app/Controllers/MonitoringController.php

    public function index()
    {
        $logModel = new \App\Models\BpjsLogModel();

        // Pagination
        $data = [
            'logs'  => $logModel->orderBy('created_at', 'DESC')->paginate(10, 'group1'),
            'pager' => $logModel->pager,
        ];
---
SELECT *
FROM "bpjs_logs"
ORDER BY "created_at" DESC
 LIMIT 10 OFFSET 10
SELECT COUNT(*) AS "numrows"
FROM "bpjs_logs"